### [참고] <a href="https://pandas.pydata.org/Pandas_Cheat_Sheet.pdf">Pandas Cheat Sheet</a>

In [ ]:
%%html
<style>
table {
    width:400px;
    float:left}
</style>

### 인덱싱 적용 방법

|적용방법|구문|결과타입|
|:---|:---:|:---:|
|열선택|df[col]|Series|
|라벨로 행 선택|df.loc[label]|Series|
|정수 위치로 행 선택|df.iloc[loc]|Series|
|행 슬라이스|df[5:10]|DataFrame|
|불리언 벡터로 행 선택|df[bool_vec]|DataFrame|

In [1]:
import pandas as pd

In [2]:
dict1 = [
    {
        "name" : "John",
        "age" : 25,
        "job" : "student"
    },
    {
        "name" : "Nate",
        "age" : 34,
        "job" : "teacher"
    },
    {
        "name" : "Jenny",
        "age" : 30,
        "job" : "developer"
    },
]
df1 = pd.DataFrame(dict1)
df1

    name  age        job
0   John   25    student
1   Nate   34    teacher
2  Jenny   30  developer

### rows, columns 기준

#### loc[]
- 5 또는 a 와 같은 단일 라벨
- ['a','b','c']와 같은 리스트나 라벨의 배열
- a:f 와 같이 라벨이 있는 처음과 끝의 범위를 포함하는 슬라이스 객체
- [True, False, True]와 같이 슬라이싱할 축과 같은 길이의 불리언 배열
- 호출하는 시리즈나 데이터 프레임을 인수로 가지는 호출 함수

#### iloc[]
- 정수
- [4,3,0] 과 같은 리스트나 정수들의 배열
- 1:7 과 같은 정숫값을 가지는 슬라이스 객체
- 불리언 배열
- 호출하는 시리즈나 데이터프레임을 인수로 가지는 호출 함수

In [3]:
df1.iloc[0]

name       John
age          25
job     student
Name: 0, dtype: object

In [4]:
# 1 : 포함하지 않음

df1.iloc[0:1]

   name  age      job
0  John   25  student

In [5]:
# iloc : 범위 지정 시 마지막 인덱스 값은 포함하지 않음

df1.iloc[1:3]

    name  age        job
1   Nate   34    teacher
2  Jenny   30  developer

In [ ]:
# pip install seaborn  시각화

In [6]:
import seaborn as sns

In [8]:
iris_df = sns.load_dataset("iris")
iris_df.head()

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

><b>df.iloc[ ] : 행, 열 모두 position 값을 이용(integer 값)</b>

In [9]:
iris_df[10:20]

    sepal_length  sepal_width  petal_length  petal_width species
10           5.4          3.7           1.5          0.2  setosa
11           4.8          3.4           1.6          0.2  setosa
12           4.8          3.0           1.4          0.1  setosa
13           4.3          3.0           1.1          0.1  setosa
14           5.8          4.0           1.2          0.2  setosa
15           5.7          4.4           1.5          0.4  setosa
16           5.4          3.9           1.3          0.4  setosa
17           5.1          3.5           1.4          0.3  setosa
18           5.7          3.8           1.7          0.3  setosa
19           5.1          3.8           1.5          0.3  setosa

In [12]:
# iloc[행,열] 

iris_df.iloc[1:3,1:3]

   sepal_width  petal_length
1          3.0           1.4
2          3.2           1.3

In [13]:
iris_df.iloc[0,0]

5.1

In [15]:
iris_df.iloc[:,[0,3]]

     sepal_length  petal_width
0             5.1          0.2
1             4.9          0.2
2             4.7          0.2
3             4.6          0.2
4             5.0          0.2
..            ...          ...
145           6.7          2.3
146           6.3          1.9
147           6.5          2.0
148           6.2          2.3
149           5.9          1.8

[150 rows x 2 columns]

><b>df.loc[ ] : 행, 열의 label 값을 이용하거나, boolean 이용 / 마지막 값 포함</b>

In [16]:
iris_df.loc[1]

sepal_length       4.9
sepal_width        3.0
petal_length       1.4
petal_width        0.2
species         setosa
Name: 1, dtype: object

In [18]:
iris_df.loc[11:15]

    sepal_length  sepal_width  petal_length  petal_width species
11           4.8          3.4           1.6          0.2  setosa
12           4.8          3.0           1.4          0.1  setosa
13           4.3          3.0           1.1          0.1  setosa
14           5.8          4.0           1.2          0.2  setosa
15           5.7          4.4           1.5          0.4  setosa

In [19]:
iris_df.loc[11:15,'sepal_width':'petal_width']

    sepal_width  petal_length  petal_width
11          3.4           1.6          0.2
12          3.0           1.4          0.1
13          3.0           1.1          0.1
14          4.0           1.2          0.2
15          4.4           1.5          0.4

In [20]:
iris_df.loc[:,'sepal_width':'petal_width']

     sepal_width  petal_length  petal_width
0            3.5           1.4          0.2
1            3.0           1.4          0.2
2            3.2           1.3          0.2
3            3.1           1.5          0.2
4            3.6           1.4          0.2
..           ...           ...          ...
145          3.0           5.2          2.3
146          2.5           5.0          1.9
147          3.0           5.2          2.0
148          3.4           5.4          2.3
149          3.0           5.1          1.8

[150 rows x 3 columns]

In [21]:
# 인덱스 레이블이 1, 3인 행의 sepal_width, petal_width 추출

iris_df.loc[[1,3],['sepal_width','petal_width']]

   sepal_width  petal_width
1          3.0          0.2
3          3.1          0.2

In [22]:
iris_df.loc[iris_df['sepal_width'] > 3.0]

     sepal_length  sepal_width  petal_length  petal_width    species
0             5.1          3.5           1.4          0.2     setosa
2             4.7          3.2           1.3          0.2     setosa
3             4.6          3.1           1.5          0.2     setosa
4             5.0          3.6           1.4          0.2     setosa
5             5.4          3.9           1.7          0.4     setosa
..            ...          ...           ...          ...        ...
140           6.7          3.1           5.6          2.4  virginica
141           6.9          3.1           5.1          2.3  virginica
143           6.8          3.2           5.9          2.3  virginica
144           6.7          3.3           5.7          2.5  virginica
148           6.2          3.4           5.4          2.3  virginica

[67 rows x 5 columns]

In [26]:
iris_df[iris_df['sepal_width'] > 3.0][['sepal_width','petal_width']]

     sepal_width  petal_width
0            3.5          0.2
2            3.2          0.2
3            3.1          0.2
4            3.6          0.2
5            3.9          0.4
..           ...          ...
140          3.1          2.4
141          3.1          2.3
143          3.2          2.3
144          3.3          2.5
148          3.4          2.3

[67 rows x 2 columns]

In [25]:
# sepal_width > 3.0 보다 큰 행에서 sepal_width, petal_width 컬럼 추출

iris_df.loc[iris_df['sepal_width'] > 3.0,['sepal_width','petal_width']]

     sepal_width  petal_width
0            3.5          0.2
2            3.2          0.2
3            3.1          0.2
4            3.6          0.2
5            3.9          0.4
..           ...          ...
140          3.1          2.4
141          3.1          2.3
143          3.2          2.3
144          3.3          2.5
148          3.4          2.3

[67 rows x 2 columns]

> **total 연습**

In [27]:
data = {"a":[1,2,3],"b":[4,5,6],"c":[7,8,9]}

df2 = pd.DataFrame(data, index=["no1","no2","no3"])
df2

     a  b  c
no1  1  4  7
no2  2  5  8
no3  3  6  9

In [28]:
# 1번 행 가져오기 iloc[] : 정수

df2.iloc[0]

a    1
b    4
c    7
Name: no1, dtype: int64

In [29]:
# 1번 행 가져오기 loc[] : 레이블명
df2.loc["no1"]

a    1
b    4
c    7
Name: no1, dtype: int64

In [32]:
# 1번행, 컬럼 a,c - iloc / loc

print(df2.iloc[0,[0,2]])

df2.loc["no1",["a","c"]]

a    1
c    7
Name: no1, dtype: int64

a    1
c    7
Name: no1, dtype: int64

#### 3) filter(items=None, like=None, regex=None, axis=None)
```
행 또는 열의 부분 집합 지정
```

In [33]:
# _가 들어있는 컬럼 추출

iris_df.filter(regex="_")

     sepal_length  sepal_width  petal_length  petal_width
0             5.1          3.5           1.4          0.2
1             4.9          3.0           1.4          0.2
2             4.7          3.2           1.3          0.2
3             4.6          3.1           1.5          0.2
4             5.0          3.6           1.4          0.2
..            ...          ...           ...          ...
145           6.7          3.0           5.2          2.3
146           6.3          2.5           5.0          1.9
147           6.5          3.0           5.2          2.0
148           6.2          3.4           5.4          2.3
149           5.9          3.0           5.1          1.8

[150 rows x 4 columns]

In [34]:
# ~ 로 시작하는 : ^
# ~ 로 끝나는 : $

iris_df.filter(regex="length$")

     sepal_length  petal_length
0             5.1           1.4
1             4.9           1.4
2             4.7           1.3
3             4.6           1.5
4             5.0           1.4
..            ...           ...
145           6.7           5.2
146           6.3           5.0
147           6.5           5.2
148           6.2           5.4
149           5.9           5.1

[150 rows x 2 columns]

In [35]:
# sepal 시작하는 컬럼 추출
iris_df.filter(regex="^sepal")

     sepal_length  sepal_width
0             5.1          3.5
1             4.9          3.0
2             4.7          3.2
3             4.6          3.1
4             5.0          3.6
..            ...          ...
145           6.7          3.0
146           6.3          2.5
147           6.5          3.0
148           6.2          3.4
149           5.9          3.0

[150 rows x 2 columns]

In [36]:
df3 = pd.DataFrame(
    [
        [1,2,3],
        [4,5,6]
    ],
    index=["mouse","rabbit"],
    columns=["one","two","three"]
)
df3

        one  two  three
mouse     1    2      3
rabbit    4    5      6

In [37]:
df3.filter(items=["one","three"])

        one  three
mouse     1      3
rabbit    4      6

In [38]:
# 정규식을 컬럼에 적용(기본)

df3.filter(regex="e$")

        one  three
mouse     1      3
rabbit    4      6

In [39]:
# axis : 0(행), 1(열)

df3.filter(regex="e$",axis=0)

       one  two  three
mouse    1    2      3

In [41]:
df3.filter(like="bbi",axis=0)

        one  two  three
rabbit    4    5      6

**[실습] friend_df**

In [42]:
dict1 = [
    {
        "name" : "John",
        "age" : 25,
        "job" : "student"
    },
    {
        "name" : "Nate",
        "age" : 34,
        "job" : "teacher"
    },
    {
        "name" : "Jenny",
        "age" : 30,
        "job" : "developer"
    },
]
friend_df = pd.DataFrame(dict1)
friend_df

    name  age        job
0   John   25    student
1   Nate   34    teacher
2  Jenny   30  developer

**1) 2번 인덱스 레이블 이용**

In [43]:
# loc

friend_df.loc[2]

name        Jenny
age            30
job     developer
Name: 2, dtype: object

**2) 0,2번 인덱스 레이블 이용**

In [44]:
# loc

friend_df.loc[[0,2]]

    name  age        job
0   John   25    student
2  Jenny   30  developer

**3) 0,2번 행을 대상으로 name, job 컬럼만 가져오기**

In [45]:
# loc

friend_df.loc[[0,2],["name","job"]]

    name        job
0   John    student
2  Jenny  developer

**4) iloc 이용 : 0번 행 가져오기**

In [46]:
friend_df.iloc[0]

name       John
age          25
job     student
Name: 0, dtype: object

**5) iloc 이용 : 1번 행의 0번 칼럼의 값 가져오기**

In [48]:
friend_df.iloc[1, 0]

'Nate'

**6) iloc 이용 : 0,1번 행 가져오기**

In [49]:
friend_df.iloc[0:2]  # friend_df.iloc[[0,1]]

   name  age      job
0  John   25  student
1  Nate   34  teacher

**7) iloc 이용 : 0,1번 행의 0번 칼럼 가져오기**

In [50]:
friend_df.iloc[0:2,0]

0    John
1    Nate
Name: name, dtype: object

**8) iloc 이용 : 0.1번 행의 0,1번 칼럼 가져오기**

In [51]:
friend_df.iloc[0:2,[0,1]]

   name  age
0  John   25
1  Nate   34

**9) iloc 이용 : 특정 값 수정 - nate 이름 변경하기**

In [54]:
friend_df.iloc[1,0] = "Torres"
friend_df

     name  age        job
0    John   25    student
1  Torres   34    teacher
2   Jenny   30  developer

**10) loc 이용 : 행 추가**

In [55]:
friend_df.loc[3] = ["Mike",25,"student"]
friend_df

     name  age        job
0    John   25    student
1  Torres   34    teacher
2   Jenny   30  developer
3    Mike   25    student

#### 11) filter 이용

In [56]:
# name, job 컬럼 추출

friend_df.filter(items=["name","job"])

     name        job
0    John    student
1  Torres    teacher
2   Jenny  developer
3    Mike    student

In [57]:
# name 컬럼 추출

friend_df.filter(items=["name"])

     name
0    John
1  Torres
2   Jenny
3    Mike

In [59]:
# 컬럼명에 a가 들어간 컬럼 추출

# friend_df.filter(regex="a")

friend_df.filter(like="a", axis=1)

     name  age
0    John   25
1  Torres   34
2   Jenny   30
3    Mike   25

In [61]:
# 행 인덱스가 0으로 끝나는 행 추출

friend_df.filter(regex="0$", axis=0)

   name  age      job
0  John   25  student

**[실습] student_df**

In [62]:
dict2 = {"국어":[15,25,35], "영어":[45,55,65], "수학":[75,85,95]}
student_df = pd.DataFrame(dict2)
student_df

   국어  영어  수학
0  15  45  75
1  25  55  85
2  35  65  95

**1) loc 사용해서 2번 행 가져오기**

In [63]:
student_df.loc[2]

국어    35
영어    65
수학    95
Name: 2, dtype: int64

**2) loc 사용해서 1번 행의 수학 점수 가져오기**

In [64]:
student_df.loc[1,"수학"]

85

**3) loc 사용해서 전체 행의 수학 점수 가져오기**

In [65]:
student_df.loc[:,"수학"]

0    75
1    85
2    95
Name: 수학, dtype: int64

#### 4) 특정 행 조회

In [66]:
student_df.loc[0]

국어    15
영어    45
수학    75
Name: 0, dtype: int64

In [67]:
student_df.iloc[0]

국어    15
영어    45
수학    75
Name: 0, dtype: int64

**[실습] month_df**

In [68]:
month_df = pd.DataFrame(dict2, index=["1월","2월","3월"])
month_df

    국어  영어  수학
1월  15  45  75
2월  25  55  85
3월  35  65  95

**1) loc 사용해서 2월 행 가져오기**

In [69]:
month_df.loc["2월"]

국어    25
영어    55
수학    85
Name: 2월, dtype: int64

**2) loc 사용해서 전체 행의 영어 컬럼 가져오기**

In [70]:
month_df.loc[:, "영어"]

1월    45
2월    55
3월    65
Name: 영어, dtype: int64

**3) loc 사용해서 2월~3월행의 전체 컬럼 가져오기**

In [71]:
month_df.loc["2월":"3월"]

    국어  영어  수학
2월  25  55  85
3월  35  65  95

**4) iloc 사용해서 2월~3월행의 전체 컬럼 가져오기**

In [72]:
month_df.iloc[1:]

    국어  영어  수학
2월  25  55  85
3월  35  65  95